[Killed] BlockStatement
src/middleware/apiKeyAuth.ts:10:87
 };
 
 export function apiKeyAuthMiddleware(pagosAuth: PagosAuthService) {
-    return async function apiKeyAuth(req: Request, res: Response, next: NextFunction) {
-        try {
-            const apiKey = req.get('x-api-key') ?? '';
-            const ctx = await pagosAuth.resolveAuthContext(apiKey);
-            (res.locals as RequestAuthLocals).auth = ctx;
-            return next();
-        } catch (err) {
-            return next(err);
-        }
-    };
+    return async function apiKeyAuth(req: Request, res: Response, next: NextFunction) {};
 }
 
killedBy: backend HTTP contract POST /session validates and returns example on 400
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/middleware/apiKeyAuth.ts:11:13
 
 export function apiKeyAuthMiddleware(pagosAuth: PagosAuthService) {
     return async function apiKeyAuth(req: Request, res: Response, next: NextFunction) {
-        try {
-            const apiKey = req.get('x-api-key') ?? '';
-            const ctx = await pagosAuth.resolveAuthContext(apiKey);
-            (res.locals as RequestAuthLocals).auth = ctx;
-            return next();
-        } catch (err) {
+        try {} catch (err) {
             return next(err);
         }
killedBy: backend HTTP contract POST /session validates and returns example on 400
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/middleware/apiKeyAuth.ts:16:23
             const ctx = await pagosAuth.resolveAuthContext(apiKey);
             (res.locals as RequestAuthLocals).auth = ctx;
             return next();
-        } catch (err) {
-            return next(err);
-        }
+        } catch (err) {}
     };
 }
killedBy: auth enforcement (HTTP) GET /agents returns 401 when x-api-key is missing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
