[Killed] LogicalOperator
src/lib/httpErrors.ts:26:19
     error: unknown,
     options?: { fallbackMessage?: string; isDev?: boolean }
 ): { error: string; details?: unknown } {
-    const isDev = options?.isDev ?? isDevelopment();
+    const isDev = options?.isDev && isDevelopment();
 
     if (error instanceof HttpError) {
killedBy: auth enforcement (HTTP) GET /agents returns 401 when x-api-key is missing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/lib/httpErrors.ts:28:37
 ): { error: string; details?: unknown } {
     const isDev = options?.isDev ?? isDevelopment();
 
-    if (error instanceof HttpError) {
-        return {
-            error: error.message,
-            ...(isDev && error.details !== undefined ? { details: error.details } : {}),
-        };
-    }
+    if (error instanceof HttpError) {}
 
     return {
killedBy: httpErrors formatErrorResponse formats HttpError without details in production
statusReason: expected 'Internal server error' to be 'Bad request' // Object.is equality

[Killed] ConditionalExpression
src/lib/httpErrors.ts:31:17
     if (error instanceof HttpError) {
         return {
             error: error.message,
-            ...(isDev && error.details !== undefined ? { details: error.details } : {}),
+            ...(true ? { details: error.details } : {}),
         };
     }
killedBy: httpErrors formatErrorResponse formats HttpError without details in production
statusReason: expected 'extra info' to be undefined

[Killed] ConditionalExpression
src/lib/httpErrors.ts:31:26
     if (error instanceof HttpError) {
         return {
             error: error.message,
-            ...(isDev && error.details !== undefined ? { details: error.details } : {}),
+            ...(isDev && true ? { details: error.details } : {}),
         };
     }
killedBy: httpErrors formatErrorResponse does not include details for HttpError when details are undefined in dev mode
statusReason: expected true to be false // Object.is equality
