[Killed] ObjectLiteral
src/services/agentService.ts:19:12
     backgroundAudio?: AgentConfig['background_audio']
 ): ForwardedBackgroundAudioConfig | undefined {
     if (!backgroundAudio?.enabled) return undefined;
-    return {
-        ambient: backgroundAudio.ambient,
-        tool_call: backgroundAudio.tool_call,
-        turn_taking: backgroundAudio.turn_taking,
-    };
+    return {};
 }
 
killedBy: agentService (unit) forwards background_audio only when enabled
statusReason: Cannot read properties of undefined (reading 'source')

[Killed] BooleanLiteral
src/services/agentService.ts:47:36
 
     const provider = avatar.provider ?? 'anam';
     const base = {
-        enabled: avatar.enabled ?? false,
+        enabled: avatar.enabled ?? true,
         provider,
         avatar_participant_name: avatar.avatar_participant_name,
killedBy: agentService (unit) defaults avatar provider to anam and enabled to false when omitted
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/services/agentService.ts:53:9
     };
 
     switch (provider) {
-        case 'anam': {
-            const anam = avatar.anam
-                ? {
-                      name: avatar.anam.name,
-                      avatarId: avatar.anam.avatarId,
-                  }
-                : undefined;
-            return { ...base, anam };
-        }
+        case 'anam':
         case 'hedra':
             return { ...base, hedra: avatar.hedra };
killedBy: agentService (unit) forwards avatar config when provided
statusReason: Cannot read properties of undefined (reading 'avatarId')

[Killed] BlockStatement
src/services/agentService.ts:53:22
     };
 
     switch (provider) {
-        case 'anam': {
-            const anam = avatar.anam
-                ? {
-                      name: avatar.anam.name,
-                      avatarId: avatar.anam.avatarId,
-                  }
-                : undefined;
-            return { ...base, anam };
-        }
+        case 'anam': {}
         case 'hedra':
             return { ...base, hedra: avatar.hedra };
killedBy: agentService (unit) forwards avatar config when provided
statusReason: Cannot read properties of undefined (reading 'avatarId')

[Killed] ConditionalExpression
src/services/agentService.ts:62:9
                 : undefined;
             return { ...base, anam };
         }
-        case 'hedra':
-            return { ...base, hedra: avatar.hedra };
+        case 'hedra':
         case 'lemonslice':
             return { ...base, lemonslice: avatar.lemonslice };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:64:9
         }
         case 'hedra':
             return { ...base, hedra: avatar.hedra };
-        case 'lemonslice':
-            return { ...base, lemonslice: avatar.lemonslice };
+        case 'lemonslice':
         case 'liveavatar':
             return { ...base, liveavatar: avatar.liveavatar };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:66:9
             return { ...base, hedra: avatar.hedra };
         case 'lemonslice':
             return { ...base, lemonslice: avatar.lemonslice };
-        case 'liveavatar':
-            return { ...base, liveavatar: avatar.liveavatar };
+        case 'liveavatar':
         case 'tavus':
             return { ...base, tavus: avatar.tavus };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:68:9
             return { ...base, lemonslice: avatar.lemonslice };
         case 'liveavatar':
             return { ...base, liveavatar: avatar.liveavatar };
-        case 'tavus':
-            return { ...base, tavus: avatar.tavus };
+        case 'tavus':
         case 'bithuman':
             return { ...base, bithuman: avatar.bithuman };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:70:9
             return { ...base, liveavatar: avatar.liveavatar };
         case 'tavus':
             return { ...base, tavus: avatar.tavus };
-        case 'bithuman':
-            return { ...base, bithuman: avatar.bithuman };
+        case 'bithuman':
         case 'simli':
             return { ...base, simli: avatar.simli };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:72:9
             return { ...base, tavus: avatar.tavus };
         case 'bithuman':
             return { ...base, bithuman: avatar.bithuman };
-        case 'simli':
-            return { ...base, simli: avatar.simli };
+        case 'simli':
         case 'bey':
             return { ...base, bey: avatar.bey };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:74:9
             return { ...base, bithuman: avatar.bithuman };
         case 'simli':
             return { ...base, simli: avatar.simli };
-        case 'bey':
-            return { ...base, bey: avatar.bey };
+        case 'bey':
         case 'avatario':
             return { ...base, avatario: avatar.avatario };
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:76:9
             return { ...base, simli: avatar.simli };
         case 'bey':
             return { ...base, bey: avatar.bey };
-        case 'avatario':
-            return { ...base, avatario: avatar.avatario };
+        case 'avatario':
         default:
             return base;
killedBy: agentService (unit) forwards provider-specific avatar payloads for all supported providers
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/agentService.ts:78:9
             return { ...base, bey: avatar.bey };
         case 'avatario':
             return { ...base, avatario: avatar.avatario };
-        default:
-            return base;
+        default:
     }
 }
killedBy: agentService (unit) falls back to base avatar shape for unknown provider values
statusReason: expected undefined to deeply equal { enabled: true, …(2) }

[Killed] LogicalOperator
src/services/agentService.ts:88:17
     const avatar = buildAvatarConfig(agentConfig.avatar);
 
     return {
-        engine: agentConfig.engine ?? AGENT_DEFAULTS.engine,
+        engine: agentConfig.engine && AGENT_DEFAULTS.engine,
         prompt: agentConfig.prompt ?? AGENT_DEFAULTS.prompt,
         dynamic_variables: agentConfig.dynamic_variables,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to deeply equal { kind: 'pipeline', …(5) }

[Killed] LogicalOperator
src/services/agentService.ts:89:17
 
     return {
         engine: agentConfig.engine ?? AGENT_DEFAULTS.engine,
-        prompt: agentConfig.prompt ?? AGENT_DEFAULTS.prompt,
+        prompt: agentConfig.prompt && AGENT_DEFAULTS.prompt,
         dynamic_variables: agentConfig.dynamic_variables,
         dynamic_variable_defaults: agentConfig.dynamic_variable_defaults,
killedBy: agentService (unit) dispatches agent with correct metadata
statusReason: expected 'You are a helpful voice AI assistant.…' to be 'Be helpful' // Object.is equality

[Killed] LogicalOperator
src/services/agentService.ts:92:25
         prompt: agentConfig.prompt ?? AGENT_DEFAULTS.prompt,
         dynamic_variables: agentConfig.dynamic_variables,
         dynamic_variable_defaults: agentConfig.dynamic_variable_defaults,
-        turn_detection: agentConfig.turn_detection ?? AGENT_DEFAULTS.turn_detection,
+        turn_detection: agentConfig.turn_detection && AGENT_DEFAULTS.turn_detection,
         noise_cancellation: agentConfig.noise_cancellation ?? AGENT_DEFAULTS.noise_cancellation,
         conversation_start: agentConfig.conversation_start ?? AGENT_DEFAULTS.conversation_start,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to be 'english' // Object.is equality

[Killed] LogicalOperator
src/services/agentService.ts:93:29
         dynamic_variables: agentConfig.dynamic_variables,
         dynamic_variable_defaults: agentConfig.dynamic_variable_defaults,
         turn_detection: agentConfig.turn_detection ?? AGENT_DEFAULTS.turn_detection,
-        noise_cancellation: agentConfig.noise_cancellation ?? AGENT_DEFAULTS.noise_cancellation,
+        noise_cancellation: agentConfig.noise_cancellation && AGENT_DEFAULTS.noise_cancellation,
         conversation_start: agentConfig.conversation_start ?? AGENT_DEFAULTS.conversation_start,
         agent_name: agentConfig.agent_name,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to deeply equal { enabled: true, type: 'auto' }

[Killed] LogicalOperator
src/services/agentService.ts:94:29
         dynamic_variable_defaults: agentConfig.dynamic_variable_defaults,
         turn_detection: agentConfig.turn_detection ?? AGENT_DEFAULTS.turn_detection,
         noise_cancellation: agentConfig.noise_cancellation ?? AGENT_DEFAULTS.noise_cancellation,
-        conversation_start: agentConfig.conversation_start ?? AGENT_DEFAULTS.conversation_start,
+        conversation_start: agentConfig.conversation_start && AGENT_DEFAULTS.conversation_start,
         agent_name: agentConfig.agent_name,
         agent_description: agentConfig.agent_description,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to deeply equal { who: 'ai', greeting: undefined }

[Killed] LogicalOperator
src/services/agentService.ts:104:16
             : undefined,
         user_id: agentConfig.user_id,
         session_id: agentConfig.session_id,
-        tools: agentConfig.tools ?? AGENT_DEFAULTS.tools,
+        tools: agentConfig.tools && AGENT_DEFAULTS.tools,
         lyzr_tools: agentConfig.lyzr_tools,
         lyzr_rag: agentConfig.lyzr_rag,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to deeply equal []

[Killed] LogicalOperator
src/services/agentService.ts:107:22
         tools: agentConfig.tools ?? AGENT_DEFAULTS.tools,
         lyzr_tools: agentConfig.lyzr_tools,
         lyzr_rag: agentConfig.lyzr_rag,
-        agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
+        agentic_rag: agentConfig.agentic_rag && AGENT_DEFAULTS.agentic_rag,
         vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
         preemptive_generation: agentConfig.preemptive_generation ?? false,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to deeply equal []

[Killed] LogicalOperator
src/services/agentService.ts:108:22
         lyzr_tools: agentConfig.lyzr_tools,
         lyzr_rag: agentConfig.lyzr_rag,
         agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
-        vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
+        vad_enabled: agentConfig.vad_enabled && AGENT_DEFAULTS.vad_enabled,
         preemptive_generation: agentConfig.preemptive_generation ?? false,
         pronunciation_correction: agentConfig.pronunciation_correction ?? false,
killedBy: agentService (unit) applies AGENT_DEFAULTS for missing fields in metadata
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/services/agentService.ts:109:69
         lyzr_rag: agentConfig.lyzr_rag,
         agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
         vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
-        preemptive_generation: agentConfig.preemptive_generation ?? false,
+        preemptive_generation: agentConfig.preemptive_generation ?? true,
         pronunciation_correction: agentConfig.pronunciation_correction ?? false,
         pronunciation_rules: agentConfig.pronunciation_rules,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/services/agentService.ts:109:32
         lyzr_rag: agentConfig.lyzr_rag,
         agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
         vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
-        preemptive_generation: agentConfig.preemptive_generation ?? false,
+        preemptive_generation: agentConfig.preemptive_generation && false,
         pronunciation_correction: agentConfig.pronunciation_correction ?? false,
         pronunciation_rules: agentConfig.pronunciation_rules,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/services/agentService.ts:110:35
         agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
         vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
         preemptive_generation: agentConfig.preemptive_generation ?? false,
-        pronunciation_correction: agentConfig.pronunciation_correction ?? false,
+        pronunciation_correction: agentConfig.pronunciation_correction && false,
         pronunciation_rules: agentConfig.pronunciation_rules,
         audio_recording_enabled: agentConfig.audio_recording_enabled ?? false,
killedBy: agentService (unit) forwards pronunciation fields
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/services/agentService.ts:110:75
         agentic_rag: agentConfig.agentic_rag ?? AGENT_DEFAULTS.agentic_rag,
         vad_enabled: agentConfig.vad_enabled ?? AGENT_DEFAULTS.vad_enabled,
         preemptive_generation: agentConfig.preemptive_generation ?? false,
-        pronunciation_correction: agentConfig.pronunciation_correction ?? false,
+        pronunciation_correction: agentConfig.pronunciation_correction ?? true,
         pronunciation_rules: agentConfig.pronunciation_rules,
         audio_recording_enabled: agentConfig.audio_recording_enabled ?? false,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/services/agentService.ts:112:73
         preemptive_generation: agentConfig.preemptive_generation ?? false,
         pronunciation_correction: agentConfig.pronunciation_correction ?? false,
         pronunciation_rules: agentConfig.pronunciation_rules,
-        audio_recording_enabled: agentConfig.audio_recording_enabled ?? false,
+        audio_recording_enabled: agentConfig.audio_recording_enabled ?? true,
         background_audio,
         avatar,
killedBy: agent dispatch metadata contract keeps defaulted dispatch metadata fields stable when config is empty
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/services/agentService.ts:112:34
         preemptive_generation: agentConfig.preemptive_generation ?? false,
         pronunciation_correction: agentConfig.pronunciation_correction ?? false,
         pronunciation_rules: agentConfig.pronunciation_rules,
-        audio_recording_enabled: agentConfig.audio_recording_enabled ?? false,
+        audio_recording_enabled: agentConfig.audio_recording_enabled && false,
         background_audio,
         avatar,
killedBy: agentService (unit) forwards audio_recording_enabled flag
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/agentService.ts:131:34
             const metadataObj = buildMetadataObject(agentConfig);
             const metadata = JSON.stringify(metadataObj);
 
-            if (isDevelopment()) {
-                logger.debug(
-                    {
-                        event: 'livekit_agent_dispatch_attempt',
-                        roomName,
-                        agentName: deps.agentName,
-                        userId: agentConfig.user_id,
-                        sessionId: agentConfig.session_id,
-                        agentConfig: summarizeAgentConfigForLog(agentConfig),
-                    },
-                    'Dispatching agent (dev)'
-                );
-            }
+            if (isDevelopment()) {}
 
             try {
killedBy: agentService (unit) logs dispatch attempt only in development mode
statusReason: expected "noop" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/agentService.ts:134:32
             if (isDevelopment()) {
                 logger.debug(
                     {
-                        event: 'livekit_agent_dispatch_attempt',
+                        event: "",
                         roomName,
                         agentName: deps.agentName,
killedBy: agentService (unit) logs dispatch attempt only in development mode
statusReason: expected "noop" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st noop call:

@@ -1,10 +1,26 @@
  [

[Killed] BlockStatement
src/services/agentService.ts:145:17
                 );
             }
 
-            try {
-                const dispatch = await deps.client.createDispatch(roomName, deps.agentName, {
-                    metadata,
-                });
-
-                logger.info(
-                    {
-                        event: 'livekit_agent_dispatch',
-                        roomName,
-                        agentName: deps.agentName,
-                        userId: agentConfig.user_id,
-                        sessionId: agentConfig.session_id,
-                        dispatchId: dispatch?.id ?? 'unknown',
-                        durationMs: Date.now() - start,
-                        outcome: 'success',
-                        agentConfig: summarizeAgentConfigForLog(agentConfig),
-                    },
-                    'Dispatched agent to room'
-                );
-            } catch (error) {
+            try {} catch (error) {
                 logger.error(
                     {
killedBy: agentService (unit) dispatches agent with correct metadata
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/services/agentService.ts:151:21
                 });
 
                 logger.info(
-                    {
-                        event: 'livekit_agent_dispatch',
-                        roomName,
-                        agentName: deps.agentName,
-                        userId: agentConfig.user_id,
-                        sessionId: agentConfig.session_id,
-                        dispatchId: dispatch?.id ?? 'unknown',
-                        durationMs: Date.now() - start,
-                        outcome: 'success',
-                        agentConfig: summarizeAgentConfigForLog(agentConfig),
-                    },
+                    {},
                     'Dispatched agent to room'
                 );
killedBy: agentService (unit) logs successful dispatch details with dispatch id and duration
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/services/agentService.ts:157:37
                         agentName: deps.agentName,
                         userId: agentConfig.user_id,
                         sessionId: agentConfig.session_id,
-                        dispatchId: dispatch?.id ?? 'unknown',
+                        dispatchId: dispatch?.id && 'unknown',
                         durationMs: Date.now() - start,
                         outcome: 'success',
killedBy: agentService (unit) logs successful dispatch details with dispatch id and duration
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

@@ -1,10 +1,26 @@
  [

[Killed] OptionalChaining
src/services/agentService.ts:157:37
                         agentName: deps.agentName,
                         userId: agentConfig.user_id,
                         sessionId: agentConfig.session_id,
-                        dispatchId: dispatch?.id ?? 'unknown',
+                        dispatchId: dispatch.id ?? 'unknown',
                         durationMs: Date.now() - start,
                         outcome: 'success',
killedBy: agentService (unit) logs fallback dispatchId when client returns undefined
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArithmeticOperator
src/services/agentService.ts:158:37
                         userId: agentConfig.user_id,
                         sessionId: agentConfig.session_id,
                         dispatchId: dispatch?.id ?? 'unknown',
-                        durationMs: Date.now() - start,
+                        durationMs: Date.now() + start,
                         outcome: 'success',
                         agentConfig: summarizeAgentConfigForLog(agentConfig),
killedBy: agentService (unit) logs successful dispatch details with dispatch id and duration
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

@@ -1,11 +1,27 @@
  [

[Killed] StringLiteral
src/services/agentService.ts:159:34
                         sessionId: agentConfig.session_id,
                         dispatchId: dispatch?.id ?? 'unknown',
                         durationMs: Date.now() - start,
-                        outcome: 'success',
+                        outcome: "",
                         agentConfig: summarizeAgentConfigForLog(agentConfig),
                     },
killedBy: agentService (unit) logs successful dispatch details with dispatch id and duration
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

@@ -1,13 +1,29 @@
  [

[Killed] BlockStatement
src/services/agentService.ts:164:29
                     },
                     'Dispatched agent to room'
                 );
-            } catch (error) {
-                logger.error(
-                    {
-                        event: 'livekit_agent_dispatch',
-                        roomName,
-                        agentName: deps.agentName,
-                        userId: agentConfig.user_id,
-                        sessionId: agentConfig.session_id,
-                        durationMs: Date.now() - start,
-                        outcome: 'error',
-                        agentConfig: summarizeAgentConfigForLog(agentConfig),
-                        err: error,
-                    },
-                    'Failed to dispatch agent to room'
-                );
-                throw error;
-            }
+            } catch (error) {}
         },
     };
killedBy: agentService (unit) rethrows client errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/services/agentService.ts:166:21
                 );
             } catch (error) {
                 logger.error(
-                    {
-                        event: 'livekit_agent_dispatch',
-                        roomName,
-                        agentName: deps.agentName,
-                        userId: agentConfig.user_id,
-                        sessionId: agentConfig.session_id,
-                        durationMs: Date.now() - start,
-                        outcome: 'error',
-                        agentConfig: summarizeAgentConfigForLog(agentConfig),
-                        err: error,
-                    },
+                    {},
                     'Failed to dispatch agent to room'
                 );
killedBy: agentService (unit) logs failure details and rethrows errors from dispatch client
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/services/agentService.ts:172:37
                         agentName: deps.agentName,
                         userId: agentConfig.user_id,
                         sessionId: agentConfig.session_id,
-                        durationMs: Date.now() - start,
+                        durationMs: Date.now() + start,
                         outcome: 'error',
                         agentConfig: summarizeAgentConfigForLog(agentConfig),
killedBy: agentService (unit) logs failure details and rethrows errors from dispatch client
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

@@ -1,10 +1,26 @@
  [
