[Killed] BlockStatement
src/services/transcriptService.ts:22:31
     if (!Array.isArray(items)) return [];
 
     const valid: ConversationItem[] = [];
-    for (const item of items) {
-        const result = ConversationItemSchema.safeParse(item);
-        if (result.success) {
-            valid.push(result.data);
-        }
-    }
+    for (const item of items) {}
     return valid;
 }
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/services/transcriptService.ts:24:29
     const valid: ConversationItem[] = [];
     for (const item of items) {
         const result = ConversationItemSchema.safeParse(item);
-        if (result.success) {
-            valid.push(result.data);
-        }
+        if (result.success) {}
     }
     return valid;
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/services/transcriptService.ts:32:32
 }
 
 function countMessages(items: ConversationItem[]): number {
-    return items.filter((i) => i.type === 'message').length;
+    return items.filter((i) => true).length;
 }
 
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/services/transcriptService.ts:32:32
 }
 
 function countMessages(items: ConversationItem[]): number {
-    return items.filter((i) => i.type === 'message').length;
+    return items.filter((i) => false).length;
 }
 
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/services/transcriptService.ts:37:9
 
 function computeDurationMs(report: SessionReport): number | null {
     const events = report.events;
-    if (!events || events.length === 0) return null;
+    if (true) return null;
 
     const first = events[0].created_at;
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected null to be 2000 // Object.is equality

[Killed] ConditionalExpression
src/services/transcriptService.ts:37:20
 
 function computeDurationMs(report: SessionReport): number | null {
     const events = report.events;
-    if (!events || events.length === 0) return null;
+    if (!events || false) return null;
 
     const first = events[0].created_at;
killedBy: transcriptService (unit) falls back to timestamp when events are empty
statusReason: Cannot read properties of undefined (reading 'created_at')

[Killed] ArithmeticOperator
src/services/transcriptService.ts:40:25
     if (!events || events.length === 0) return null;
 
     const first = events[0].created_at;
-    const last = events[events.length - 1].created_at;
+    const last = events[events.length + 1].created_at;
     return Math.round((last - first) * 1000);
 }
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: Cannot read properties of undefined (reading 'created_at')

[Killed] ArithmeticOperator
src/services/transcriptService.ts:41:23
 
     const first = events[0].created_at;
     const last = events[events.length - 1].created_at;
-    return Math.round((last - first) * 1000);
+    return Math.round((last - first) / 1000);
 }
 
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected +0 to be 2000 // Object.is equality

[Killed] ArithmeticOperator
src/services/transcriptService.ts:41:24
 
     const first = events[0].created_at;
     const last = events[events.length - 1].created_at;
-    return Math.round((last - first) * 1000);
+    return Math.round((last + first) * 1000);
 }
 
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected 4000 to be 2000 // Object.is equality

[Killed] BlockStatement
src/services/transcriptService.ts:46:38
 
 function computeStartedAt(report: SessionReport): Date {
     const events = report.events;
-    if (events && events.length > 0) {
-        return new Date(events[0].created_at * 1000);
-    }
+    if (events && events.length > 0) {}
     return new Date(report.timestamp * 1000);
 }
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected '1970-01-01T00:00:04.000Z' to be '1970-01-01T00:00:01.000Z' // Object.is equality

[Killed] ConditionalExpression
src/services/transcriptService.ts:46:9
 
 function computeStartedAt(report: SessionReport): Date {
     const events = report.events;
-    if (events && events.length > 0) {
+    if (false) {
         return new Date(events[0].created_at * 1000);
     }
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected '1970-01-01T00:00:04.000Z' to be '1970-01-01T00:00:01.000Z' // Object.is equality

[Killed] ArithmeticOperator
src/services/transcriptService.ts:47:25
 function computeStartedAt(report: SessionReport): Date {
     const events = report.events;
     if (events && events.length > 0) {
-        return new Date(events[0].created_at * 1000);
+        return new Date(events[0].created_at / 1000);
     }
     return new Date(report.timestamp * 1000);
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected '1970-01-01T00:00:00.000Z' to be '1970-01-01T00:00:01.000Z' // Object.is equality

[Killed] ArithmeticOperator
src/services/transcriptService.ts:49:21
     if (events && events.length > 0) {
         return new Date(events[0].created_at * 1000);
     }
-    return new Date(report.timestamp * 1000);
+    return new Date(report.timestamp / 1000);
 }
 
killedBy: transcriptService (unit) falls back to timestamp when events are empty
statusReason: expected '1970-01-01T00:00:00.000Z' to be '1970-01-01T00:00:10.000Z' // Object.is equality

[Killed] ArithmeticOperator
src/services/transcriptService.ts:53:21
 }
 
 function computeEndedAt(report: SessionReport): Date {
-    return new Date(report.timestamp * 1000);
+    return new Date(report.timestamp / 1000);
 }
 
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected '1970-01-01T00:00:00.000Z' to be '1970-01-01T00:00:04.000Z' // Object.is equality

[Killed] MethodExpression
src/services/transcriptService.ts:81:33
                     {
                         event: 'transcript_ingest_invalid_report',
                         roomName: input.roomName,
-                        issues: parseResult.error.issues.slice(0, 5),
+                        issues: parseResult.error.issues,
                     },
                     'Session report failed validation — skipping transcript persistence'
killedBy: transcriptService (unit) logs at most 5 validation issues when report has many issues
statusReason: expected [ { expected: 'string', …(3) }, …(5) ] to have a length of 5 but got 6

[Killed] LogicalOperator
src/services/transcriptService.ts:94:26
             return deps.store.save({
                 sessionId: input.sessionId,
                 roomName: input.roomName,
-                agentId: input.agentId ?? null,
+                agentId: input.agentId && null,
                 orgId: input.orgId,
                 createdByUserId: input.createdByUserId ?? null,
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected null to be '507f1f77bcf86cd799439011' // Object.is equality

[Killed] LogicalOperator
src/services/transcriptService.ts:96:34
                 roomName: input.roomName,
                 agentId: input.agentId ?? null,
                 orgId: input.orgId,
-                createdByUserId: input.createdByUserId ?? null,
+                createdByUserId: input.createdByUserId && null,
                 sessionReport: report,
                 chatHistory,
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected null to be 'member_user_1' // Object.is equality

[Killed] LogicalOperator
src/services/transcriptService.ts:99:30
                 createdByUserId: input.createdByUserId ?? null,
                 sessionReport: report,
                 chatHistory,
-                closeReason: input.closeReason ?? null,
+                closeReason: input.closeReason && null,
                 durationMs: computeDurationMs(report),
                 messageCount: countMessages(chatHistory),
killedBy: transcriptService (unit) parses observability report and computes transcript fields
statusReason: expected null to be 'normal' // Object.is equality
