[Killed] LogicalOperator
src/telephony/core/sipAttributes.ts:8:21
     to: string | null;
 } {
     if (!attrs) return { from: null, to: null };
-    const rawFrom = attrs['sip.phoneNumber'] ?? null;
+    const rawFrom = attrs['sip.phoneNumber'] && null;
     const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
     return {
killedBy: extractSipFromTo extracts both from and to when attributes are present
statusReason: expected { from: null, to: '+15559876543' } to deeply equal { from: '+15551234567', …(1) }

[Killed] LogicalOperator
src/telephony/core/sipAttributes.ts:9:19
 } {
     if (!attrs) return { from: null, to: null };
     const rawFrom = attrs['sip.phoneNumber'] ?? null;
-    const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
+    const rawTo = attrs['sip.trunkPhoneNumber'] && null;
     return {
         from: typeof rawFrom === 'string' && rawFrom.length > 0 ? normalizeE164(rawFrom) : null,
killedBy: extractSipFromTo extracts both from and to when attributes are present
statusReason: expected { from: '+15551234567', to: null } to deeply equal { from: '+15551234567', …(1) }

[Killed] ConditionalExpression
src/telephony/core/sipAttributes.ts:11:15
     const rawFrom = attrs['sip.phoneNumber'] ?? null;
     const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
     return {
-        from: typeof rawFrom === 'string' && rawFrom.length > 0 ? normalizeE164(rawFrom) : null,
+        from: false ? normalizeE164(rawFrom) : null,
         to: typeof rawTo === 'string' && rawTo.length > 0 ? normalizeE164(rawTo) : null,
     };
killedBy: extractSipFromTo extracts both from and to when attributes are present
statusReason: expected { from: null, to: '+15559876543' } to deeply equal { from: '+15551234567', …(1) }

[Killed] EqualityOperator
src/telephony/core/sipAttributes.ts:11:46
     const rawFrom = attrs['sip.phoneNumber'] ?? null;
     const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
     return {
-        from: typeof rawFrom === 'string' && rawFrom.length > 0 ? normalizeE164(rawFrom) : null,
+        from: typeof rawFrom === 'string' && rawFrom.length <= 0 ? normalizeE164(rawFrom) : null,
         to: typeof rawTo === 'string' && rawTo.length > 0 ? normalizeE164(rawTo) : null,
     };
killedBy: extractSipFromTo extracts both from and to when attributes are present
statusReason: expected { from: null, to: '+15559876543' } to deeply equal { from: '+15551234567', …(1) }

[Killed] ConditionalExpression
src/telephony/core/sipAttributes.ts:12:42
     const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
     return {
         from: typeof rawFrom === 'string' && rawFrom.length > 0 ? normalizeE164(rawFrom) : null,
-        to: typeof rawTo === 'string' && rawTo.length > 0 ? normalizeE164(rawTo) : null,
+        to: typeof rawTo === 'string' && true ? normalizeE164(rawTo) : null,
     };
 }
killedBy: extractSipFromTo returns nulls when attribute values are empty strings
statusReason: expected { from: null, to: '' } to deeply equal { from: null, to: null }

[Killed] ConditionalExpression
src/telephony/core/sipAttributes.ts:12:13
     const rawTo = attrs['sip.trunkPhoneNumber'] ?? null;
     return {
         from: typeof rawFrom === 'string' && rawFrom.length > 0 ? normalizeE164(rawFrom) : null,
-        to: typeof rawTo === 'string' && rawTo.length > 0 ? normalizeE164(rawTo) : null,
+        to: true ? normalizeE164(rawTo) : null,
     };
 }
killedBy: extractSipFromTo returns nulls when attrs is an empty object
statusReason: Cannot read properties of null (reading 'trim')
