[Killed] StringLiteral
src/config/tools.ts:10:15
 export const toolRegistry: ToolDefinition[] = [
     {
         id: 'get_weather',
-        name: 'Get Weather',
+        name: "",
         description: 'Fetch current weather conditions for a city via Open-Meteo.',
     },
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:14:13
         description: 'Fetch current weather conditions for a city via Open-Meteo.',
     },
     {
-        id: 'search_wikipedia',
+        id: "",
         name: 'Search Wikipedia',
         description: 'Look up a short summary for a topic from Wikipedia.',
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:15:15
     },
     {
         id: 'search_wikipedia',
-        name: 'Search Wikipedia',
+        name: "",
         description: 'Look up a short summary for a topic from Wikipedia.',
     },
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:16:22
     {
         id: 'search_wikipedia',
         name: 'Search Wikipedia',
-        description: 'Look up a short summary for a topic from Wikipedia.',
+        description: "",
     },
     {
killedBy: auth enforcement (HTTP) GET /agents returns 401 when x-api-key is missing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:21:22
     {
         id: 'add_note',
         name: 'Add Note',
-        description: 'Store a short note for the current room on the agent.',
+        description: "",
     },
     {
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:26:22
     {
         id: 'list_notes',
         name: 'List Notes',
-        description: 'List notes stored for the current room on the agent.',
+        description: "",
     },
     {
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:30:15
     },
     {
         id: 'call_sub_agent',
-        name: 'Call Sub-Agent',
+        name: "",
         description: 'Delegate a task to a specialized sub-agent via the sub-agent API.',
     },
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:34:13
         description: 'Delegate a task to a specialized sub-agent via the sub-agent API.',
     },
     {
-        id: 'search_knowledge_base',
+        id: "",
         name: 'Search Knowledge Base',
         description: 'Retrieve relevant snippets from the configured knowledge base (RAG).',
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:35:15
     },
     {
         id: 'search_knowledge_base',
-        name: 'Search Knowledge Base',
+        name: "",
         description: 'Retrieve relevant snippets from the configured knowledge base (RAG).',
     },
killedBy: backend HTTP contract GET / returns API metadata and endpoints (telephony disabled)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/config/tools.ts:36:22
     {
         id: 'search_knowledge_base',
         name: 'Search Knowledge Base',
-        description: 'Retrieve relevant snippets from the configured knowledge base (RAG).',
+        description: "",
     },
 ];
killedBy: auth enforcement (HTTP) GET /agents returns 401 when x-api-key is missing
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/config/tools.ts:49:16
 export function normalizeTools(agentConfig?: AgentConfig): string[] {
     const tools = agentConfig?.tools;
     if (!Array.isArray(tools)) {
-        return registryIds.has(KNOWLEDGE_BASE_TOOL_ID) && hasKnowledgeBaseEnabled(agentConfig)
+        return true
             ? [KNOWLEDGE_BASE_TOOL_ID]
             : [];
killedBy: config/tools normalizeTools returns empty array when no tools provided
statusReason: expected [ 'search_knowledge_base' ] to deeply equal []

[Killed] ConditionalExpression
src/config/tools.ts:49:16
 export function normalizeTools(agentConfig?: AgentConfig): string[] {
     const tools = agentConfig?.tools;
     if (!Array.isArray(tools)) {
-        return registryIds.has(KNOWLEDGE_BASE_TOOL_ID) && hasKnowledgeBaseEnabled(agentConfig)
+        return false
             ? [KNOWLEDGE_BASE_TOOL_ID]
             : [];
killedBy: config/tools normalizeTools adds knowledge-base tool when tools is non-array and KB is enabled
statusReason: expected [] to deeply equal [ 'search_knowledge_base' ]

[Killed] BlockStatement
src/config/tools.ts:55:60
     }
     const requestedTools: unknown[] = tools;
 
-    const wildcardEnabled = requestedTools.some((value) => {
-        if (typeof value !== 'string') return false;
-        const normalized = value.trim().toLowerCase();
-        return normalized === '*' || normalized === 'all';
-    });
+    const wildcardEnabled = requestedTools.some((value) => {});
 
     if (wildcardEnabled) {
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] MethodExpression
src/config/tools.ts:55:29
     }
     const requestedTools: unknown[] = tools;
 
-    const wildcardEnabled = requestedTools.some((value) => {
-        if (typeof value !== 'string') return false;
-        const normalized = value.trim().toLowerCase();
-        return normalized === '*' || normalized === 'all';
-    });
+    const wildcardEnabled = requestedTools.every(value => {
+  if (typeof value !== 'string') return false;
+  const normalized = value.trim().toLowerCase();
+  return normalized === '*' || normalized === 'all';
+});
 
     if (wildcardEnabled) {
killedBy: config/tools normalizeTools wildcard behavior still applies when mixed with non-wildcard entries
statusReason: expected [ 'get_weather' ] to deeply equal [ 'get_weather', …(4) ]

[Killed] BooleanLiteral
src/config/tools.ts:56:47
     const requestedTools: unknown[] = tools;
 
     const wildcardEnabled = requestedTools.some((value) => {
-        if (typeof value !== 'string') return false;
+        if (typeof value !== 'string') return true;
         const normalized = value.trim().toLowerCase();
         return normalized === '*' || normalized === 'all';
killedBy: config/tools normalizeTools ignores non-string tool entries
statusReason: expected [ 'get_weather', …(4) ] to deeply equal [ 'get_weather' ]

[Killed] MethodExpression
src/config/tools.ts:57:28
 
     const wildcardEnabled = requestedTools.some((value) => {
         if (typeof value !== 'string') return false;
-        const normalized = value.trim().toLowerCase();
+        const normalized = value.trim().toUpperCase();
         return normalized === '*' || normalized === 'all';
     });
killedBy: config/tools normalizeTools wildcard "all" enables all registry tools
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/config/tools.ts:57:28
 
     const wildcardEnabled = requestedTools.some((value) => {
         if (typeof value !== 'string') return false;
-        const normalized = value.trim().toLowerCase();
+        const normalized = value.toLowerCase();
         return normalized === '*' || normalized === 'all';
     });
killedBy: config/tools normalizeTools trims wildcard values before matching
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/config/tools.ts:58:38
     const wildcardEnabled = requestedTools.some((value) => {
         if (typeof value !== 'string') return false;
         const normalized = value.trim().toLowerCase();
-        return normalized === '*' || normalized === 'all';
+        return normalized === '*' || normalized !== 'all';
     });
 
killedBy: config/tools normalizeTools filters out unknown tool IDs
statusReason: expected [ 'get_weather', …(4) ] to deeply equal [ 'get_weather' ]

[Killed] ConditionalExpression
src/config/tools.ts:58:16
     const wildcardEnabled = requestedTools.some((value) => {
         if (typeof value !== 'string') return false;
         const normalized = value.trim().toLowerCase();
-        return normalized === '*' || normalized === 'all';
+        return false;
     });
 
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] ConditionalExpression
src/config/tools.ts:61:9
         return normalized === '*' || normalized === 'all';
     });
 
-    if (wildcardEnabled) {
+    if (false) {
         return toolRegistry
             .map((t) => t.id)
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] BlockStatement
src/config/tools.ts:61:26
         return normalized === '*' || normalized === 'all';
     });
 
-    if (wildcardEnabled) {
-        return toolRegistry
-            .map((t) => t.id)
-            .filter(
-                (id) =>
-                    id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
-            );
-    }
+    if (wildcardEnabled) {}
 
     const cleaned: string[] = [];
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] MethodExpression
src/config/tools.ts:62:16
     });
 
     if (wildcardEnabled) {
-        return toolRegistry
-            .map((t) => t.id)
-            .filter(
-                (id) =>
-                    id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
-            );
+        return toolRegistry.map(t => t.id);
     }
 
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [ 'get_weather', …(5) ] to deeply equal [ 'get_weather', …(4) ]

[Killed] ArrowFunction
src/config/tools.ts:65:17
         return toolRegistry
             .map((t) => t.id)
             .filter(
-                (id) =>
-                    id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
+                () => undefined
             );
     }
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] LogicalOperator
src/config/tools.ts:66:21
             .map((t) => t.id)
             .filter(
                 (id) =>
-                    id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
+                    id !== KNOWLEDGE_BASE_TOOL_ID && registryIds.has(KNOWLEDGE_BASE_TOOL_ID) && hasKnowledgeBaseEnabled(agentConfig)
             );
     }
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [] to deeply equal [ 'get_weather', …(4) ]

[Killed] EqualityOperator
src/config/tools.ts:66:21
             .map((t) => t.id)
             .filter(
                 (id) =>
-                    id !== KNOWLEDGE_BASE_TOOL_ID ||
+                    id === KNOWLEDGE_BASE_TOOL_ID ||
                     (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
                         hasKnowledgeBaseEnabled(agentConfig))
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [ 'search_knowledge_base' ] to deeply equal [ 'get_weather', …(4) ]

[Killed] ConditionalExpression
src/config/tools.ts:67:22
             .filter(
                 (id) =>
                     id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
+                    (false)
             );
     }
killedBy: config/tools normalizeTools wildcard with KB enabled includes search_knowledge_base
statusReason: expected [ 'get_weather', …(4) ] to deeply equal [ 'get_weather', …(5) ]

[Killed] LogicalOperator
src/config/tools.ts:67:22
             .filter(
                 (id) =>
                     id !== KNOWLEDGE_BASE_TOOL_ID ||
-                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-                        hasKnowledgeBaseEnabled(agentConfig))
+                    (registryIds.has(KNOWLEDGE_BASE_TOOL_ID) || hasKnowledgeBaseEnabled(agentConfig))
             );
     }
killedBy: config/tools normalizeTools wildcard "*" enables all registry tools (except KB when KB not enabled)
statusReason: expected [ 'get_weather', …(5) ] to deeply equal [ 'get_weather', …(4) ]

[Killed] BlockStatement
src/config/tools.ts:73:38
     }
 
     const cleaned: string[] = [];
-    for (const id of requestedTools) {
-        if (typeof id !== 'string') continue;
-        if (!registryIds.has(id)) continue;
-        if (cleaned.includes(id)) continue;
-        cleaned.push(id);
-    }
+    for (const id of requestedTools) {}
 
     // Auto-enable knowledge base tool when knowledge base is enabled.
killedBy: config/tools normalizeTools filters out unknown tool IDs
statusReason: expected [] to deeply equal [ 'get_weather' ]

[Killed] ConditionalExpression
src/config/tools.ts:75:13
     const cleaned: string[] = [];
     for (const id of requestedTools) {
         if (typeof id !== 'string') continue;
-        if (!registryIds.has(id)) continue;
+        if (false) continue;
         if (cleaned.includes(id)) continue;
         cleaned.push(id);
killedBy: config/tools normalizeTools filters out unknown tool IDs
statusReason: expected [ 'get_weather', 'fake_tool' ] to deeply equal [ 'get_weather' ]

[Killed] BooleanLiteral
src/config/tools.ts:75:13
     const cleaned: string[] = [];
     for (const id of requestedTools) {
         if (typeof id !== 'string') continue;
-        if (!registryIds.has(id)) continue;
+        if (registryIds.has(id)) continue;
         if (cleaned.includes(id)) continue;
         cleaned.push(id);
killedBy: session routes (integration) resolves stored agent config via agentId with org/user scope before dispatch
statusReason: expected [] to deeply equal [ 'get_weather' ]

[Killed] ConditionalExpression
src/config/tools.ts:76:13
     for (const id of requestedTools) {
         if (typeof id !== 'string') continue;
         if (!registryIds.has(id)) continue;
-        if (cleaned.includes(id)) continue;
+        if (false) continue;
         cleaned.push(id);
     }
killedBy: config/tools normalizeTools deduplicates tool IDs
statusReason: expected [ 'get_weather', 'get_weather' ] to deeply equal [ 'get_weather' ]

[Killed] ConditionalExpression
src/config/tools.ts:82:9
 
     // Auto-enable knowledge base tool when knowledge base is enabled.
     if (
-        registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-        !cleaned.includes(KNOWLEDGE_BASE_TOOL_ID) &&
-        hasKnowledgeBaseEnabled(agentConfig)
+        true
     ) {
         cleaned.push(KNOWLEDGE_BASE_TOOL_ID);
killedBy: config/tools normalizeTools filters out unknown tool IDs
statusReason: expected [ 'get_weather', …(1) ] to deeply equal [ 'get_weather' ]

[Killed] ConditionalExpression
src/config/tools.ts:82:9
 
     // Auto-enable knowledge base tool when knowledge base is enabled.
     if (
-        registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-        !cleaned.includes(KNOWLEDGE_BASE_TOOL_ID) &&
+        true &&
         hasKnowledgeBaseEnabled(agentConfig)
     ) {
killedBy: config/tools normalizeTools does not duplicate knowledge-base tool when already requested
statusReason: expected [ 'search_knowledge_base', …(2) ] to deeply equal [ 'search_knowledge_base', …(1) ]

[Killed] BooleanLiteral
src/config/tools.ts:83:9
     // Auto-enable knowledge base tool when knowledge base is enabled.
     if (
         registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
-        !cleaned.includes(KNOWLEDGE_BASE_TOOL_ID) &&
+        cleaned.includes(KNOWLEDGE_BASE_TOOL_ID) &&
         hasKnowledgeBaseEnabled(agentConfig)
     ) {
killedBy: config/tools normalizeTools auto-adds search_knowledge_base when KB is enabled
statusReason: expected [ 'get_weather' ] to include 'search_knowledge_base'

[Killed] BlockStatement
src/config/tools.ts:85:7
         registryIds.has(KNOWLEDGE_BASE_TOOL_ID) &&
         !cleaned.includes(KNOWLEDGE_BASE_TOOL_ID) &&
         hasKnowledgeBaseEnabled(agentConfig)
-    ) {
-        cleaned.push(KNOWLEDGE_BASE_TOOL_ID);
-    }
+    ) {}
 
     return cleaned;
killedBy: config/tools normalizeTools auto-adds search_knowledge_base when KB is enabled
statusReason: expected [ 'get_weather' ] to include 'search_knowledge_base'

[Killed] ObjectLiteral
src/config/tools.ts:106:12
     const kb = agentConfig?.knowledge_base;
     if (!kb?.enabled) return {};
 
-    return {
-        ...(kb.lyzr_rag ? { lyzr_rag: kb.lyzr_rag } : {}),
-        agentic_rag: kb.agentic_rag ?? [],
-    };
+    return {};
 }
 
killedBy: config/tools deriveRagConfigFromKnowledgeBase extracts lyzr_rag when KB is enabled
statusReason: expected undefined to deeply equal { base_url: 'http://x', …(2) }

[Killed] ObjectLiteral
src/config/tools.ts:107:27
     if (!kb?.enabled) return {};
 
     return {
-        ...(kb.lyzr_rag ? { lyzr_rag: kb.lyzr_rag } : {}),
+        ...(kb.lyzr_rag ? {} : {}),
         agentic_rag: kb.agentic_rag ?? [],
     };
killedBy: config/tools deriveRagConfigFromKnowledgeBase extracts lyzr_rag when KB is enabled
statusReason: expected undefined to deeply equal { base_url: 'http://x', …(2) }

[Killed] LogicalOperator
src/config/tools.ts:108:22
 
     return {
         ...(kb.lyzr_rag ? { lyzr_rag: kb.lyzr_rag } : {}),
-        agentic_rag: kb.agentic_rag ?? [],
+        agentic_rag: kb.agentic_rag && [],
     };
 }
killedBy: config/tools deriveRagConfigFromKnowledgeBase defaults agentic_rag to empty array when KB enabled but none provided
statusReason: expected undefined to deeply equal []

[Killed] ObjectLiteral
src/config/tools.ts:116:12
  * Apply tool normalization and KB-derived RAG fields to produce a dispatch-ready config.
  */
 export function finalizeAgentConfig(agentConfig: AgentConfig): AgentConfig {
-    return {
-        ...agentConfig,
-        tools: normalizeTools(agentConfig),
-        ...deriveRagConfigFromKnowledgeBase(agentConfig),
-    };
+    return {};
 }
 
killedBy: config/tools finalizeAgentConfig normalizes tools and derives RAG fields in one pass
statusReason: expected undefined to deeply equal [ 'get_weather', …(1) ]
