[Killed] ConditionalExpression
src/services/sessionService.ts:105:9
     auth: EndSessionAuthContext,
     session: { orgId?: string; createdByUserId?: string }
 ): boolean {
-    if (session.orgId !== auth.orgId) {
+    if (true) {
         return false;
     }
killedBy: session routes (integration) creates, ends, ingests observability, and cleans up session end-to-end
statusReason: expected 204 "No Content", got 404 "Not Found"

[Killed] EqualityOperator
src/services/sessionService.ts:105:9
     auth: EndSessionAuthContext,
     session: { orgId?: string; createdByUserId?: string }
 ): boolean {
-    if (session.orgId !== auth.orgId) {
+    if (session.orgId === auth.orgId) {
         return false;
     }
killedBy: sessionService (unit) endSession marks session as ended
statusReason: Session not found for room

[Killed] BooleanLiteral
src/services/sessionService.ts:106:16
     session: { orgId?: string; createdByUserId?: string }
 ): boolean {
     if (session.orgId !== auth.orgId) {
-        return false;
+        return true;
     }
     if (!auth.isAdmin && session.createdByUserId !== auth.userId) {
killedBy: sessionService (unit) endSession denies cross-org access by sessionId
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/services/sessionService.ts:108:26
     if (session.orgId !== auth.orgId) {
         return false;
     }
-    if (!auth.isAdmin && session.createdByUserId !== auth.userId) {
+    if (!auth.isAdmin && true) {
         return false;
     }
killedBy: sessionService (unit) endSession marks session as ended
statusReason: Session not found for room

[Killed] ConditionalExpression
src/services/sessionService.ts:108:9
     if (session.orgId !== auth.orgId) {
         return false;
     }
-    if (!auth.isAdmin && session.createdByUserId !== auth.userId) {
+    if (true) {
         return false;
     }
killedBy: sessionService (unit) endSession marks session as ended
statusReason: Session not found for room

[Killed] BooleanLiteral
src/services/sessionService.ts:109:16
         return false;
     }
     if (!auth.isAdmin && session.createdByUserId !== auth.userId) {
-        return false;
+        return true;
     }
     return true;
killedBy: sessionService (unit) endSession denies cross-user access for non-admin in same org
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/services/sessionService.ts:118:9
     timingsMs: CreateSessionStepTimingsMs | undefined,
     key: keyof CreateSessionStepTimingsMs,
     valueMs: number
-): void {
-    if (!timingsMs) return;
-    timingsMs[key] = Math.max(0, Math.round(valueMs));
-}
+): void {}
 
 export function createSessionService(deps: SessionServiceDeps) {
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected {} to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] MethodExpression
src/services/sessionService.ts:120:22
     valueMs: number
 ): void {
     if (!timingsMs) return;
-    timingsMs[key] = Math.max(0, Math.round(valueMs));
+    timingsMs[key] = Math.min(0, Math.round(valueMs));
 }
 
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: +0, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] MethodExpression
src/services/sessionService.ts:132:34
             const now = options.now ?? Date.now;
             const timingsMs = options.timingsMs;
             const totalStart = now();
-            const userIdentity = input.userIdentity.trim();
+            const userIdentity = input.userIdentity;
             const requestedRoomName = input.roomName?.trim() ?? '';
             const requestedSessionId = input.sessionId?.trim() ?? '';
killedBy: sessionService (unit) normalizes userIdentity, roomName, and sessionId by trimming whitespace
statusReason: expected "spy" to be called with arguments: [ 'user_trim', 'room-trim' ]

Received: 

  1st spy call:

  [
-   "user_trim",

[Killed] MethodExpression
src/services/sessionService.ts:133:39
             const timingsMs = options.timingsMs;
             const totalStart = now();
             const userIdentity = input.userIdentity.trim();
-            const requestedRoomName = input.roomName?.trim() ?? '';
+            const requestedRoomName = input.roomName ?? '';
             const requestedSessionId = input.sessionId?.trim() ?? '';
 
killedBy: sessionService (unit) normalizes userIdentity, roomName, and sessionId by trimming whitespace
statusReason: expected '  room-trim  ' to be 'room-trim' // Object.is equality

[Killed] MethodExpression
src/services/sessionService.ts:134:40
             const totalStart = now();
             const userIdentity = input.userIdentity.trim();
             const requestedRoomName = input.roomName?.trim() ?? '';
-            const requestedSessionId = input.sessionId?.trim() ?? '';
+            const requestedSessionId = input.sessionId ?? '';
 
             const roomName =
killedBy: sessionService (unit) normalizes userIdentity, roomName, and sessionId by trimming whitespace
statusReason: expected '  00000000-0000-4000-8000-00000000000…' to be '00000000-0000-4000-8000-000000000000' // Object.is equality

[Killed] EqualityOperator
src/services/sessionService.ts:137:17
             const requestedSessionId = input.sessionId?.trim() ?? '';
 
             const roomName =
-                requestedRoomName.length > 0 ? requestedRoomName : `room-${randomUUID()}`;
+                requestedRoomName.length <= 0 ? requestedRoomName : `room-${randomUUID()}`;
             const sessionId = requestedSessionId.length > 0 ? requestedSessionId : randomUUID();
 
killedBy: sessionService (unit) creates a session, dispatches agent, and stores metadata
statusReason: expected '' to match /^room-/

[Killed] EqualityOperator
src/services/sessionService.ts:137:17
             const requestedSessionId = input.sessionId?.trim() ?? '';
 
             const roomName =
-                requestedRoomName.length > 0 ? requestedRoomName : `room-${randomUUID()}`;
+                requestedRoomName.length >= 0 ? requestedRoomName : `room-${randomUUID()}`;
             const sessionId = requestedSessionId.length > 0 ? requestedSessionId : randomUUID();
 
killedBy: sessionService (unit) creates a session, dispatches agent, and stores metadata
statusReason: expected '' to match /^room-/

[Killed] ConditionalExpression
src/services/sessionService.ts:138:31
 
             const roomName =
                 requestedRoomName.length > 0 ? requestedRoomName : `room-${randomUUID()}`;
-            const sessionId = requestedSessionId.length > 0 ? requestedSessionId : randomUUID();
+            const sessionId = false ? requestedSessionId : randomUUID();
 
             const resolveConfigStart = now();
killedBy: sessionService (unit) normalizes userIdentity, roomName, and sessionId by trimming whitespace
statusReason: expected '9d6c92fb-bf95-4a82-b3cf-529b199cb830' to be '00000000-0000-4000-8000-000000000000' // Object.is equality

[Killed] ConditionalExpression
src/services/sessionService.ts:138:31
 
             const roomName =
                 requestedRoomName.length > 0 ? requestedRoomName : `room-${randomUUID()}`;
-            const sessionId = requestedSessionId.length > 0 ? requestedSessionId : randomUUID();
+            const sessionId = true ? requestedSessionId : randomUUID();
 
             const resolveConfigStart = now();
killedBy: session routes (integration) creates, ends, ingests observability, and cleans up session end-to-end
statusReason: expected 204 "No Content", got 400 "Bad Request"

[Killed] StringLiteral
src/services/sessionService.ts:144:46
             let resolvedConfig: AgentConfig;
             if (input.agentId) {
                 if (!input.orgId || !input.createdByUserId) {
-                    throw new HttpError(401, 'Missing auth context');
+                    throw new HttpError(401, "");
                 }
                 resolvedConfig = await deps.agentConfigResolver.resolveByAgentId({
killedBy: sessionService (unit) rejects agentId session creation when auth context is missing
statusReason: expected HttpError { status: 401, …(1) } to match object { Object (name, status, ...) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/services/sessionService.ts:152:60
                     accessScope: {
                         orgId: input.orgId,
                         userId: input.createdByUserId,
-                        isAdmin: input.requesterIsAdmin ?? false,
+                        isAdmin: input.requesterIsAdmin ?? true,
                     },
                 });
killedBy: sessionService (unit) defaults requesterIsAdmin to false when omitted for agentId resolution scope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/services/sessionService.ts:158:56
             } else {
                 resolvedConfig = input.agentConfig ?? {};
             }
-            recordTiming(timingsMs, 'resolveConfigMs', now() - resolveConfigStart);
+            recordTiming(timingsMs, 'resolveConfigMs', now() + resolveConfigStart);
 
             const finalizeConfigStart = now();
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 2005, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] ArithmeticOperator
src/services/sessionService.ts:163:57
             const finalizeConfigStart = now();
             const finalAgentConfig = finalizeAgentConfig(resolvedConfig);
             const finalAgentConfigWithDefaults = applyDefaultDynamicVariables(finalAgentConfig);
-            recordTiming(timingsMs, 'finalizeConfigMs', now() - finalizeConfigStart);
+            recordTiming(timingsMs, 'finalizeConfigMs', now() + finalizeConfigStart);
 
             const agentConfigWithIds: AgentConfig = {
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 3, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] ArithmeticOperator
src/services/sessionService.ts:174:52
 
             const tokenMintStart = now();
             const userToken = await deps.tokenService.createUserToken(userIdentity, roomName);
-            recordTiming(timingsMs, 'tokenMintMs', now() - tokenMintStart);
+            recordTiming(timingsMs, 'tokenMintMs', now() + tokenMintStart);
 
             if (isDevelopment()) {
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 3, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] BlockStatement
src/services/sessionService.ts:176:34
             const userToken = await deps.tokenService.createUserToken(userIdentity, roomName);
             recordTiming(timingsMs, 'tokenMintMs', now() - tokenMintStart);
 
-            if (isDevelopment()) {
-                logger.debug(
-                    {
-                        event: 'session_create_dispatch_attempt',
-                        roomName,
-                        userIdentity,
-                        agentId: input.agentId,
-                        agentConfig: summarizeAgentConfigForLog(finalAgentConfigWithDefaults),
-                        hasApiKey: Boolean(agentConfigWithIds.api_key),
-                    },
-                    'Dispatching agent (dev)'
-                );
-            }
+            if (isDevelopment()) {}
 
             const dispatchStart = now();
killedBy: sessionService (unit) logs dispatch attempt only in development mode
statusReason: expected "noop" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/sessionService.ts:186:21
                         agentConfig: summarizeAgentConfigForLog(finalAgentConfigWithDefaults),
                         hasApiKey: Boolean(agentConfigWithIds.api_key),
                     },
-                    'Dispatching agent (dev)'
+                    ""
                 );
             }
killedBy: sessionService (unit) logs dispatch attempt only in development mode
statusReason: expected "noop" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st noop call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/services/sessionService.ts:191:17
             }
 
             const dispatchStart = now();
-            try {
-                await deps.agentService.dispatchAgent(roomName, agentConfigWithIds);
-            } catch (error) {
+            try {} catch (error) {
                 recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
                 recordTiming(timingsMs, 'totalMs', now() - totalStart);
killedBy: sessionService (unit) creates a session, dispatches agent, and stores metadata
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/services/sessionService.ts:193:29
             const dispatchStart = now();
             try {
                 await deps.agentService.dispatchAgent(roomName, agentConfigWithIds);
-            } catch (error) {
-                recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
-                recordTiming(timingsMs, 'totalMs', now() - totalStart);
-                throw new HttpError(
-                    502,
-                    'Failed to dispatch agent',
-                    error instanceof Error ? error.message : error
-                );
-            }
+            } catch (error) {}
             recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
 
killedBy: sessionService (unit) wraps agent dispatch failures as 502 and does not store the session
statusReason: promise resolved "{ userToken: 'token-1', …(5) }" instead of rejecting

[Killed] ArithmeticOperator
src/services/sessionService.ts:194:55
             try {
                 await deps.agentService.dispatchAgent(roomName, agentConfigWithIds);
             } catch (error) {
-                recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
+                recordTiming(timingsMs, 'dispatchMs', now() + dispatchStart);
                 recordTiming(timingsMs, 'totalMs', now() - totalStart);
                 throw new HttpError(
killedBy: sessionService (unit) records dispatch and total timings on dispatch failure
statusReason: expected 4037 to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/services/sessionService.ts:195:52
                 await deps.agentService.dispatchAgent(roomName, agentConfigWithIds);
             } catch (error) {
                 recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
-                recordTiming(timingsMs, 'totalMs', now() - totalStart);
+                recordTiming(timingsMs, 'totalMs', now() + totalStart);
                 throw new HttpError(
                     502,
killedBy: sessionService (unit) records dispatch and total timings on dispatch failure
statusReason: expected 4025 to be 25 // Object.is equality

[Killed] StringLiteral
src/services/sessionService.ts:198:21
                 recordTiming(timingsMs, 'totalMs', now() - totalStart);
                 throw new HttpError(
                     502,
-                    'Failed to dispatch agent',
+                    "",
                     error instanceof Error ? error.message : error
                 );
killedBy: sessionService (unit) wraps agent dispatch failures as 502 and does not store the session
statusReason: expected HttpError { status: 502, …(1) } to match object { Object (name, status, ...) }

[Killed] ArithmeticOperator
src/services/sessionService.ts:202:51
                     error instanceof Error ? error.message : error
                 );
             }
-            recordTiming(timingsMs, 'dispatchMs', now() - dispatchStart);
+            recordTiming(timingsMs, 'dispatchMs', now() + dispatchStart);
 
             const storeWriteStart = now();
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 3, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] ArithmeticOperator
src/services/sessionService.ts:213:53
                 agentConfig: agentConfigWithIds,
                 createdAt: new Date().toISOString(),
             });
-            recordTiming(timingsMs, 'storeWriteMs', now() - storeWriteStart);
+            recordTiming(timingsMs, 'storeWriteMs', now() + storeWriteStart);
             recordTiming(timingsMs, 'totalMs', now() - totalStart);
 
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 3, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] ArithmeticOperator
src/services/sessionService.ts:214:48
                 createdAt: new Date().toISOString(),
             });
             recordTiming(timingsMs, 'storeWriteMs', now() - storeWriteStart);
-            recordTiming(timingsMs, 'totalMs', now() - totalStart);
+            recordTiming(timingsMs, 'totalMs', now() + totalStart);
 
             return {
killedBy: sessionService (unit) records rounded non-negative step timings for successful session creation
statusReason: expected { resolveConfigMs: 3, …(5) } to deeply equal { resolveConfigMs: 3, …(5) }

[Killed] MethodExpression
src/services/sessionService.ts:227:40
         },
 
         async endSession(input: EndSessionInput): Promise<void> {
-            const normalizedRoomName = input.roomName?.trim() ?? '';
+            const normalizedRoomName = input.roomName ?? '';
             const normalizedSessionId = input.sessionId?.trim() ?? '';
             const { auth } = input;
killedBy: sessionService (unit) endSession trims roomName before lookup
statusReason: Session not found for room

[Killed] MethodExpression
src/services/sessionService.ts:228:41
 
         async endSession(input: EndSessionInput): Promise<void> {
             const normalizedRoomName = input.roomName?.trim() ?? '';
-            const normalizedSessionId = input.sessionId?.trim() ?? '';
+            const normalizedSessionId = input.sessionId ?? '';
             const { auth } = input;
 
killedBy: sessionService (unit) endSession trims sessionId before lookup
statusReason: Session not found for sessionId

[Killed] LogicalOperator
src/services/sessionService.ts:228:41
 
         async endSession(input: EndSessionInput): Promise<void> {
             const normalizedRoomName = input.roomName?.trim() ?? '';
-            const normalizedSessionId = input.sessionId?.trim() ?? '';
+            const normalizedSessionId = input.sessionId?.trim() && '';
             const { auth } = input;
 
killedBy: sessionService (unit) endSession denies cross-org access by sessionId
statusReason: expected HttpError: Must provide roomName or sessi… { …(2) } to match object { Object (name, status, ...) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/services/sessionService.ts:231:62
             const normalizedSessionId = input.sessionId?.trim() ?? '';
             const { auth } = input;
 
-            if (!normalizedRoomName && !normalizedSessionId) {
-                throw new HttpError(400, 'Must provide roomName or sessionId');
-            }
+            if (!normalizedRoomName && !normalizedSessionId) {}
 
             let roomName = normalizedRoomName;
killedBy: sessionService (unit) endSession requires roomName or sessionId
statusReason: expected HttpError: Session not found for sessionId { …(2) } to match object { status: 400, …(1) }
(2 matching properties omitted from actual)

[Killed] BooleanLiteral
src/services/sessionService.ts:231:40
             const normalizedSessionId = input.sessionId?.trim() ?? '';
             const { auth } = input;
 
-            if (!normalizedRoomName && !normalizedSessionId) {
+            if (!normalizedRoomName && normalizedSessionId) {
                 throw new HttpError(400, 'Must provide roomName or sessionId');
             }
killedBy: sessionService (unit) endSession requires roomName or sessionId
statusReason: expected HttpError: Session not found for sessionId { …(2) } to match object { status: 400, …(1) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/services/sessionService.ts:242:21
                 if (!existing) {
                     throw new HttpError(404, 'Session not found for room');
                 }
-                if (!canAccessSession(auth, existing)) {
+                if (true) {
                     throw new HttpError(404, 'Session not found for room');
                 }
killedBy: sessionService (unit) endSession marks session as ended
statusReason: Session not found for room

[Killed] BlockStatement
src/services/sessionService.ts:242:56
                 if (!existing) {
                     throw new HttpError(404, 'Session not found for room');
                 }
-                if (!canAccessSession(auth, existing)) {
-                    throw new HttpError(404, 'Session not found for room');
-                }
+                if (!canAccessSession(auth, existing)) {}
             } else {
                 const allEntries = await deps.store.entries();
killedBy: sessionService (unit) endSession denies cross-user access for non-admin in same org
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/services/sessionService.ts:247:61
                 }
             } else {
                 const allEntries = await deps.store.entries();
-                const match = allEntries.find(([, data]) => {
-                    if (data.sessionId !== normalizedSessionId) {
-                        return false;
-                    }
-                    return canAccessSession(auth, data);
-                });
+                const match = allEntries.find(([, data]) => {});
 
                 if (!match) {
killedBy: sessionService (unit) endSession allows same-org admins to end another user session by sessionId
statusReason: Session not found for sessionId

[Killed] ConditionalExpression
src/services/sessionService.ts:248:25
             } else {
                 const allEntries = await deps.store.entries();
                 const match = allEntries.find(([, data]) => {
-                    if (data.sessionId !== normalizedSessionId) {
+                    if (false) {
                         return false;
                     }
killedBy: sessionService (unit) endSession by sessionId updates only the matching session entry
statusReason: expected '2026-02-26T09:42:50.100Z' to be undefined

[Killed] EqualityOperator
src/services/sessionService.ts:248:25
             } else {
                 const allEntries = await deps.store.entries();
                 const match = allEntries.find(([, data]) => {
-                    if (data.sessionId !== normalizedSessionId) {
+                    if (data.sessionId === normalizedSessionId) {
                         return false;
                     }
killedBy: sessionService (unit) endSession allows same-org admins to end another user session by sessionId
statusReason: Session not found for sessionId

[Killed] BooleanLiteral
src/services/sessionService.ts:249:32
                 const allEntries = await deps.store.entries();
                 const match = allEntries.find(([, data]) => {
                     if (data.sessionId !== normalizedSessionId) {
-                        return false;
+                        return true;
                     }
                     return canAccessSession(auth, data);
killedBy: sessionService (unit) endSession by sessionId updates only the matching session entry
statusReason: expected '2026-02-26T09:42:52.949Z' to be undefined

[Killed] BlockStatement
src/services/sessionService.ts:277:63
             });
         },
 
-        async cleanupSession(roomName: string): Promise<void> {
-            const normalizedRoomName = roomName.trim();
-
-            try {
-                await deps.roomService.deleteRoom(normalizedRoomName);
-            } catch (error) {
-                throw new HttpError(
-                    502,
-                    `Failed to delete LiveKit room "${normalizedRoomName}"`,
-                    error instanceof Error ? error.message : error
-                );
-            }
-
-            await deps.store.delete(normalizedRoomName);
-        },
+        async cleanupSession(roomName: string): Promise<void> {},
     };
 }
killedBy: sessionService (unit) cleanupSession deletes the room and clears the store entry
statusReason: expected "spy" to be called with arguments: [ 'room-1' ]

Number of calls: 0

[Killed] MethodExpression
src/services/sessionService.ts:278:40
         },
 
         async cleanupSession(roomName: string): Promise<void> {
-            const normalizedRoomName = roomName.trim();
+            const normalizedRoomName = roomName;
 
             try {
killedBy: sessionService (unit) cleanupSession trims roomName before deleting room
statusReason: expected "spy" to be called with arguments: [ 'room-trim-clean' ]

Received: 

  1st spy call:

  [
-   "room-trim-clean",

[Killed] BlockStatement
src/services/sessionService.ts:280:17
         async cleanupSession(roomName: string): Promise<void> {
             const normalizedRoomName = roomName.trim();
 
-            try {
-                await deps.roomService.deleteRoom(normalizedRoomName);
-            } catch (error) {
+            try {} catch (error) {
                 throw new HttpError(
                     502,
killedBy: sessionService (unit) cleanupSession deletes the room and clears the store entry
statusReason: expected "spy" to be called with arguments: [ 'room-1' ]

Number of calls: 0

[Killed] BlockStatement
src/services/sessionService.ts:282:29
 
             try {
                 await deps.roomService.deleteRoom(normalizedRoomName);
-            } catch (error) {
-                throw new HttpError(
-                    502,
-                    `Failed to delete LiveKit room "${normalizedRoomName}"`,
-                    error instanceof Error ? error.message : error
-                );
-            }
+            } catch (error) {}
 
             await deps.store.delete(normalizedRoomName);
killedBy: sessionService (unit) cleanupSession throws 502 with context when room deletion fails
statusReason: promise resolved "undefined" instead of rejecting
