[Killed] BlockStatement
src/telephony/routing/bindingBasedCallRouting.ts:26:34
         const binding = await this.bindingStore.getBindingByE164(normalizedDid);
 
         if (binding && binding.enabled) {
-            if (binding.agentId) {
-                try {
-                    const resolvedAgentConfig = await this.agentConfigResolver.resolveByAgentId({
-                        agentId: binding.agentId,
-                    });
-                    return {
-                        agentConfig: {
-                            ...resolvedAgentConfig,
-                            agent_id: binding.agentId,
-                        },
-                    };
-                } catch (err) {
-                    logger.warn(
-                        {
-                            event: 'telephony.binding.agent_resolution_failed',
-                            bindingId: binding.id,
-                            e164: binding.e164,
-                            agentId: binding.agentId,
-                            err,
-                        },
-                        'Failed to resolve latest agent config from bound agentId'
-                    );
-                    return this.fallback.resolveRouting(ctx);
-                }
-            }
+            if (binding.agentId) {}
         }
 
killedBy: BindingBasedCallRouting resolves latest config by agentId when a matching binding is found
statusReason: expected { noise_cancellation: { …(2) }, …(2) } to deeply equal { …(3) }

[Killed] BlockStatement
src/telephony/routing/bindingBasedCallRouting.ts:27:21
 
         if (binding && binding.enabled) {
             if (binding.agentId) {
-                try {
-                    const resolvedAgentConfig = await this.agentConfigResolver.resolveByAgentId({
-                        agentId: binding.agentId,
-                    });
-                    return {
-                        agentConfig: {
-                            ...resolvedAgentConfig,
-                            agent_id: binding.agentId,
-                        },
-                    };
-                } catch (err) {
+                try {} catch (err) {
                     logger.warn(
                         {
killedBy: BindingBasedCallRouting resolves latest config by agentId when a matching binding is found
statusReason: expected { noise_cancellation: { …(2) }, …(2) } to deeply equal { …(3) }

[Killed] BlockStatement
src/telephony/routing/bindingBasedCallRouting.ts:37:31
                             agent_id: binding.agentId,
                         },
                     };
-                } catch (err) {
-                    logger.warn(
-                        {
-                            event: 'telephony.binding.agent_resolution_failed',
-                            bindingId: binding.id,
-                            e164: binding.e164,
-                            agentId: binding.agentId,
-                            err,
-                        },
-                        'Failed to resolve latest agent config from bound agentId'
-                    );
-                    return this.fallback.resolveRouting(ctx);
-                }
+                } catch (err) {}
             }
         }
killedBy: BindingBasedCallRouting falls back to default routing when agentId resolution fails
statusReason: expected "LOG" to be called 1 times, but got 0 times

[Killed] StringLiteral
src/telephony/routing/bindingBasedCallRouting.ts:46:25
                             agentId: binding.agentId,
                             err,
                         },
-                        'Failed to resolve latest agent config from bound agentId'
+                        ""
                     );
                     return this.fallback.resolveRouting(ctx);
killedBy: BindingBasedCallRouting falls back to default routing when agentId resolution fails
statusReason: expected "LOG" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Received: 

  1st LOG call:

  [
-   ObjectContaining {
